Бухгалтерия_для_Казахстана_демо.ГрупповоеПерепроведениеПоРаписанию/src/InformationRegisters/ГП_ПараметрыРегламентныхЗаданий/ГП_ПараметрыРегламентныхЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГП_ПараметрыРегламентныхЗаданий</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВыбранныеТипыСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Организации</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <dimensions>
    <name>Параметр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Бухгалтерия_для_Казахстана_демо.ГрупповоеПерепроведениеПоРаписанию/src/CommonModules/ГП_ОбщийМодуль/Module.bsl
#Область ПрограммныйИнтерфейс

// Регламентное перепроведение документов по расписанию с последующей отправкой отчета на электронную почту.
Процедура ГП_ПерепроведениеДокументовПоРасписанию() Экспорт
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	// Получаем все параметры из регистра сведений
	ПараметрыИзРегистра = РегистрыСведений.ГП_ПараметрыРегламентныхЗаданий.ПолучитьВсеПараметры();
	
	// Дата начала перепроведения
	ДатаНачала = ПараметрыИзРегистра.ДатаНачалаПроведения;
	Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
		ДатаНачала = НачалоМесяца(ТекущаяДата);
	КонецЕсли;
	ДатаОкончания = КонецДня(ТекущаяДата);
	
	// Организации из регистра или все
	ВыбранныеОрганизации = Новый Массив;
	СтрокаОрганизаций = ПараметрыИзРегистра.ВыбранныеОрганизации;
	Если ЗначениеЗаполнено(СтрокаОрганизаций) Тогда
		ВыбранныеОрганизации = СериализаторXDTO.ПрочитатьXDTO(СтрокаОрганизаций);
		Если ТипЗнч(ВыбранныеОрганизации) <> Тип("Массив") Тогда
			ВыбранныеОрганизации = Новый Массив;
		КонецЕсли;
	КонецЕсли;
	
	// Выбранные типы документов из регистра
	ВыбранныеТипы = ПараметрыИзРегистра.ВыбранныеТипыСтрокой;
	
	ПараметрыПерепроведения = Новый Структура;
	ПараметрыПерепроведения.Вставить("Организация", ВыбранныеОрганизации);
	ПараметрыПерепроведения.Вставить("ДатаНачала", ДатаНачала);
	ПараметрыПерепроведения.Вставить("ДатаОкончания", ДатаОкончания);
	ПараметрыПерепроведения.Вставить("ЗаписыватьОшибкиВЖурналРегистрации", Истина);
	ПараметрыПерепроведения.Вставить("ОстанавливатьсяПоОшибке", Ложь);
	ПараметрыПерепроведения.Вставить("СообщатьПрогрессВыполнения", Ложь);
	ПараметрыПерепроведения.Вставить("АдресХранилищаСОшибками", ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор));
	ПараметрыПерепроведения.Вставить("ДанныеЗаблокированы", Истина);
	ПараметрыПерепроведения.Вставить("ТолькоВыбранныеОрганизации", Истина);
	ПараметрыПерепроведения.Вставить("ВыбранныеТипы", ВыбранныеТипы); 
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
    Обработки.ГрупповоеПерепроведениеДокументов.ПерепроведениеДокументов(ПараметрыПерепроведения, АдресХранилища);
	
	// обновляем дату начала проведения в регистре
	РегистрыСведений.ГП_ПараметрыРегламентныхЗаданий.УстановитьПараметр("ДатаНачалаПроведения", ТекущаяДатаСеанса());

	// письмо
	Получатели = ПолучателиПисьма();
	Если Получатели = "" Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКФайлу = ПолучитьИмяВременногоФайла("txt");
	
    Попытка     
        РезультатыПерепроведения = ПолучитьИзВременногоХранилища(АдресХранилища);
        ТабДок = ПолучитьИзВременногоХранилища(РезультатыПерепроведения.АдресХранилищаСОшибками).ОтчетПоОшибкам;
        ТабДок.Записать(ПутьКФайлу, ТипФайлаТабличногоДокумента.TXT);
    Исключение
        Текст = Новый ЗаписьТекста(ПутьКФайлу, КодировкаТекста.ANSI);
        Текст.ЗаписатьСтроку("" + ВыбранныеОрганизации);
        Текст.ЗаписатьСтроку("Выполнено перепроведение документов за период: " + ДатаНачала + " - " + ДатаОкончания);
        Текст.ЗаписатьСтроку("Ошибок при перепроведение не было.");
        Текст.Закрыть(); 
	КонецПопытки;

	ТемаСообщения = "Отчет о проведении документов за " + Формат(ТекущаяДата, "ДФ=dd.MM.yyyy");
	Тело = ТемаСообщения;

	ОписаниеВложения = Новый Структура;
	ОписаниеВложения.Вставить("Представление", ТемаСообщения + ".txt");
	ОписаниеВложения.Вставить("АдресВоВременномХранилище", ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПутьКФайлу)));

	ПараметрыСообщения = Новый Структура;	
	ПараметрыСообщения.Вставить("Кому",     Получатели);
	ПараметрыСообщения.Вставить("Тема",     ТемаСообщения);
	ПараметрыСообщения.Вставить("Тело",     Тело);
	ПараметрыСообщения.Вставить("Вложения", Новый Массив);
	
	ПараметрыСообщения.Вложения.Добавить(ОписаниеВложения);
	УдалитьФайлы(ПутьКФайлу);

	Попытка
		НовоеПисьмо = РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты, ПараметрыСообщения);
		РаботаСПочтовымиСообщениями.ОтправитьПисьмо(Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты, НовоеПисьмо)
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("Ошибка отправки отчета о проведении документов", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
	КонецПопытки;

КонецПроцедуры

// Обновляет параметры регламентных заданий на основании данных документа проведения.
//
// Параметры:
//   Источник - ДокументОбъект - Документ, на основании которого обновляются параметры
//   Отказ - Булево - Признак отказа от проведения документа
//   РежимПроведения - РежимПроведенияДокумента - Режим проведения документа
Процедура ОбновитьПараметрыРегламентныхЗаданий_ГПОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	// Проверяем, нужно ли обрабатывать данный документ
	Если НЕ ДокументПодходитДляПерепроведения(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	// Получаем количество месяцев для перепроведения (до блокировки, т.к. меняется редко)
	КоличествоМесяцев = РегистрыСведений.ГП_ПараметрыРегламентныхЗаданий.ПолучитьПараметр("КоличествоМесяцевДляПерепроведения", 1);
	
	// Вычисляем минимально допустимую дату начала перепроведения
	// (чтобы не уходить слишком далеко в прошлое)
	МинимальноДопустимаяДата = ДобавитьМесяц(ТекущаяДатаСеанса(), -КоличествоМесяцев);
	
	// Определяем новую дату начала проведения:
	// берём максимум из даты документа и минимально допустимой даты
	НоваяДатаНачала = Макс(Источник.Дата, МинимальноДопустимаяДата);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ГП_ПараметрыРегламентныхЗаданий");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Параметр", "ДатаНачалаПроведения");

	Попытка
		Блокировка.Заблокировать();
		
		// Получаем текущую дату начала проведения
		ТекущаяДатаНачала = РегистрыСведений.ГП_ПараметрыРегламентныхЗаданий.ПолучитьПараметр("ДатаНачалаПроведения", '00010101');
		
		// Если новая дата меньше текущей (или дата не задана), обновляем
		Если НЕ ЗначениеЗаполнено(ТекущаяДатаНачала) ИЛИ ТекущаяДатаНачала > НоваяДатаНачала Тогда
			// Сохраняем дату начала проведения и ссылку на документ
			РегистрыСведений.ГП_ПараметрыРегламентныхЗаданий.УстановитьПараметр("ДатаНачалаПроведения", НоваяДатаНачала, Источник.Ссылка);
		КонецЕсли;
		
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("Ошибка обновления параметров регламентного задания", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

// Инициализирует дополнительные свойства для работы расширения.
// Вызывается один раз при первом запуске системы.
//
Процедура ИнициализироватьДополнительныеСвойства() Экспорт
	
	// Проверяем, существует ли уже свойство
	ИмяСвойства = "ПолучательРассылкиОПроведении_a4469ddd895b48fc96f2b4de7ee0e443";
	СуществующееСвойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", ИмяСвойства);
	
	Если ЗначениеЗаполнено(СуществующееСвойство) Тогда
		// Свойство уже существует
		Возврат;
	КонецЕсли;
	
	Попытка
		// Параметры для создания дополнительного сведения
		Параметры = Новый Структура;
		Параметры.Вставить("Имя", ИмяСвойства); // Техническое имя для поиска
		Параметры.Вставить("Наименование", "Получатель рассылки о проведении"); // Отображаемое название
		Параметры.Вставить("Тип", Новый ОписаниеТипов("Булево"));
		
		// Создаем дополнительное сведение для справочника Пользователи
		УправлениеСвойствами.ДобавитьСвойство("Справочник.Пользователи", Параметры, Истина);
		
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("Инициализация дополнительных свойств", 
			УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

// Возвращает ограничение типа с только проводимыми документами.
//
// Возвращаемое значение:
//   ОписаниеТипов - описание типов, содержащее только проводимые документы
//
Функция ПолучитьОграничениеТипаПроводимыхДокументов() Экспорт
	
	МассивПроводимыхДокументов = Новый Массив;
	
	Для Каждого ОбъектМетаданных Из Метаданные.Документы Цикл
		// Проверяем, что документ проводится
		Если ОбъектМетаданных.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить Тогда
			МассивПроводимыхДокументов.Добавить(Тип("ДокументСсылка." + ОбъектМетаданных.Имя));
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый ОписаниеТипов(МассивПроводимыхДокументов);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверяет, подходит ли документ для перепроведения по настройкам регистра.
//
// Параметры:
//   Источник - ДокументОбъект - проверяемый документ
//
// Возвращаемое значение:
//   Булево - Истина, если документ подходит для обработки
//
Функция ДокументПодходитДляПерепроведения(Источник)
	
	// Получаем список выбранных типов документов
	ВыбранныеТипыСтрокой = РегистрыСведений.ГП_ПараметрыРегламентныхЗаданий.ПолучитьПараметр("ВыбранныеТипыСтрокой", "");
	
	// Если типы не выбраны, документ не подходит
	Если НЕ ЗначениеЗаполнено(ВыбранныеТипыСтрокой) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Проверяем, входит ли тип документа в список выбранных типов
	МассивВыбранныхТипов = СтрРазделить(ВыбранныеТипыСтрокой, ";");
	ТипДокумента = ТипЗнч(Источник.Ссылка);
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипДокумента);
	
	Если ОбъектМетаданных = Неопределено ИЛИ МассивВыбранныхТипов.Найти(ОбъектМетаданных.Имя) = Неопределено Тогда
		// Документ не входит в список выбранных типов
		Возврат Ложь;
	КонецЕсли;
	
	// Проверяем фильтр по организациям
	СтрокаОрганизаций = РегистрыСведений.ГП_ПараметрыРегламентныхЗаданий.ПолучитьПараметр("ВыбранныеОрганизации", "");
	
	// Если организации не выбраны, документ не подходит
	Если НЕ ЗначениеЗаполнено(СтрокаОрганизаций) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Десериализуем массив организаций
	ВыбранныеОрганизации = СериализаторXDTO.ПрочитатьXDTO(СтрокаОрганизаций);
	
	Если ТипЗнч(ВыбранныеОрганизации) = Тип("Массив") И ВыбранныеОрганизации.Количество() > 0 Тогда
		
		// Проверяем, есть ли у документа реквизит Организация
		Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Источник, "Организация") Тогда
			Возврат Ложь;
		КонецЕсли;
		
		// Если организация документа не входит в список выбранных
		Если ВыбранныеОрганизации.Найти(Источник.Организация) = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучателиПисьма()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|		КонтактнаяИнформация.Представление КАК Представление
	|	ИЗ
	|		РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|			ПО ДополнительныеСведения.Объект = КонтактнаяИнформация.Объект
	|				И (КонтактнаяИнформация.Тип = Значение(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	|				И (КонтактнаяИнформация.Вид = Значение(Справочник.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя))
	|	ГДЕ
	|		ДополнительныеСведения.Свойство = &Свойство
	|		И ДополнительныеСведения.Значение = Истина
	|";	

	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ПолучательРассылкиОПроведении_a4469ddd895b48fc96f2b4de7ee0e443"));
	Результат = Запрос.Выполнить();
	
	Получатели = Новый Массив;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Получатели.Добавить(СокрЛП(Выборка.Представление));
	КонецЦикла;
	
	Возврат СтрСоединить(Получатели, ";");

КонецФункции

#КонецОбласти
